liuweisword/NRF52_LOCK/examples/ble_peripheral/ble_app_template/main.c
    nrf_clock_lf_cfg_t clock_lf_cfg = NRF_CLOCK_LFCLKSRC;
    SOFTDEVICE_HANDLER_INIT(&clock_lf_cfg, NULL);

}



/**@brief Function for application main entry.
 */
int main(void)
{
    uint32_t err_code;
    bool erase_bonds;

    // Initialize.
    system_clock_init();

    local_led_init();                                                           //init heart led3
    local_uart_init();                                                          //init uart1
    local_timer_init();                                                         //init timer
    local_button_init();                                                    //init button3 init  toggle led2

    //buttons_leds_init(&erase_bonds);//按键和LED灯初始化
	printf("----------------------BT_LOCK----------------------------");
    printf("\r\nUART Start!\r\n");
    printf("\r\nlocal: uart1 init success!!\r\n");

    ble_stack_init();
    device_manager_init(erase_bonds);                                           //设备管理初始化
    gap_params_init();                                                          //GAP参数初始化
    services_init();                                                            //服务初始化
    advertising_init();                                                         //广播初始化
    conn_params_init();                                                         //更新过程初始化

    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);                        //开始广播
    APP_ERROR_CHECK(err_code);


    printf("\r\nlocal: pc end!!\r\n");
    // Enter main loop.
    for (;;)
    {
        power_manage();
    }

}


/**
 * @}
 */
